InformationRegisters/БухучетЗарплатыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>БухучетЗарплатыОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/УчетХозрасчетныхОрганизаций/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область НачальнаяНастройкаПрограммы

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ПараметрыПрограммы.ИспользоватьСтатьиФинансирования Тогда
		ПервоначальноеЗаполнениеОбъектовАналитики();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область НастройкаРасчетаЗарплаты

Процедура ЗаписатьНастройкиНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ПараметрыНастроек.ИспользоватьСтатьиФинансирования Тогда
		Константы.ИспользоватьСтатьиФинансированияЗарплата.Установить(Параметры.ИспользоватьСтатьиФинансирования);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПриДобавленииОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "УчетХозрасчетныхОрганизаций.УстановитьНастройкиУчетХозрасчетныхОрганизаций";
	Обработчик.НачальноеЗаполнение = Истина;
	

КонецПроцедуры

Процедура УстановитьНастройкиУчетХозрасчетныхОрганизаций() Экспорт
	
	РаботаВХозрасчетнойОрганизации = Константы.РаботаВХозрасчетнойОрганизации.Получить();
	Если Не РаботаВХозрасчетнойОрганизации Тогда
		Константы.РаботаВХозрасчетнойОрганизации.Установить(Истина);
	КонецЕсли;
	
	РаботаВБюджетномУчреждении = Константы.РаботаВБюджетномУчреждении.Получить();
	Если РаботаВБюджетномУчреждении Тогда
		Константы.РаботаВБюджетномУчреждении.Установить(Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеСтатьиБюджетноеФинансирование()
	
	Возврат Новый Структура("Код, Наименование",  НСтр("ru='БФ';uk='БФ'"),  НСтр("ru='Бюджетное финансирование';uk='Бюджетне фінансування'"));
	
КонецФункции

Функция СоздатьСтатьюФинансированияПоОписанию(ОписаниеСтатьи)

	УстановитьПривилегированныйРежим(Истина);
	
	СправочникСтатьиФинансирования = Справочники.СтатьиФинансированияЗарплата;
	СтатьяФинансирования = СправочникСтатьиФинансирования.НайтиПоНаименованию(ОписаниеСтатьи.Наименование, Истина);
	Если СтатьяФинансирования.Пустая() Тогда
		
		НовыйЭлемент = СправочникСтатьиФинансирования.СоздатьЭлемент();
		НовыйЭлемент.Наименование = ОписаниеСтатьи.Наименование;
		НовыйЭлемент.Код = ОписаниеСтатьи.Код;
		НовыйЭлемент.Записать();
		СтатьяФинансирования = НовыйЭлемент.Ссылка;
		
	Иначе
		
		СтатьяФинансированияОбъект = СтатьяФинансирования.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(СтатьяФинансированияОбъект.Код) Тогда
			СтатьяФинансированияОбъект.Код = ОписаниеСтатьи.Код;
			СтатьяФинансированияОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтатьяФинансирования;

КонецФункции

Функция ОписаниеСтатьиПредпринимательскаяДеятельность()

	Возврат Новый Структура("Код, Наименование",  НСтр("ru='ПД';uk='ПД'"),  НСтр("ru='Предпринимательская деятельность';uk='Підприємницька діяльність'"));

КонецФункции

Функция НаименованиеОсновногоСпособаОтражения()

	Возврат НСтр("ru='26. Общехозяйственные расходы';uk='26. Загальногосподарські витрати'");

КонецФункции

Функция СоздатьСпособОтраженияПоНаименованию(НаименованиеСпособаОтражения)

	УстановитьПривилегированныйРежим(Истина);
	
	СправочникиСпособыОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете;
	СпособОтражения = СправочникиСпособыОтраженияЗарплатыВБухУчете.НайтиПоНаименованию(НаименованиеСпособаОтражения, Истина);
	Если СпособОтражения.Пустая() Тогда
		
		НовыйЭлемент = СправочникиСпособыОтраженияЗарплатыВБухУчете.СоздатьЭлемент();
		НовыйЭлемент.Наименование = НаименованиеСпособаОтражения;
		НовыйЭлемент.Записать();
		СпособОтражения = НовыйЭлемент.Ссылка;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СпособОтражения;

КонецФункции

Процедура ПервоначальноеЗаполнениеОбъектовАналитики() Экспорт
	
	СоздатьСтатьюФинансированияПоОписанию(ОписаниеСтатьиБюджетноеФинансирование());
	СоздатьСтатьюФинансированияПоОписанию(ОписаниеСтатьиПредпринимательскаяДеятельность());
	СоздатьСпособОтраженияПоНаименованию(НаименованиеОсновногоСпособаОтражения());

КонецПроцедуры

Функция БухучетОрганизацииПоУмолчанию() Экспорт

	Настройки = РегистрыСведений.БухучетЗарплатыОрганизаций.СоздатьМенеджерЗаписи();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
		ОписаниеСтатьи = ОписаниеСтатьиПредпринимательскаяДеятельность();
		СтатьяФинансирования = Справочники.СтатьиФинансированияЗарплата.НайтиПоНаименованию(ОписаниеСтатьи.Наименование, Истина);
		Если СтатьяФинансирования.Пустая() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	БухучетЗарплатыОрганизаций.СтатьяФинансирования
			|ИЗ
			|	РегистрСведений.БухучетЗарплатыОрганизаций КАК БухучетЗарплатыОрганизаций
			|ГДЕ
			|	БухучетЗарплатыОрганизаций.СтатьяФинансирования <> ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка)";
			
			УстановитьПривилегированныйРежим(Истина);
			Результат = Запрос.Выполнить();
			УстановитьПривилегированныйРежим(Ложь);
			Если Результат.Пустой() Тогда
				СтатьяФинансирования = СоздатьСтатьюФинансированияПоОписанию(ОписаниеСтатьи);
			Иначе
				Выборка = Результат.Выбрать();
				СтатьяФинансирования = Выборка.СтатьяФинансирования;
			КонецЕсли;	
			
		КонецЕсли;
		
		Настройки.СтатьяФинансирования = СтатьяФинансирования;
		
	КонецЕсли;	
	
	НаименованиеСпособаОтражения = НаименованиеОсновногоСпособаОтражения();
	СпособОтражения = Справочники.СпособыОтраженияЗарплатыВБухУчете.НайтиПоНаименованию(НаименованиеСпособаОтражения, Истина);
	Если СпособОтражения.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БухучетЗарплатыОрганизаций.СпособОтраженияЗарплатыВБухучете
		|ИЗ
		|	РегистрСведений.БухучетЗарплатыОрганизаций КАК БухучетЗарплатыОрганизаций
		|ГДЕ
		|	БухучетЗарплатыОрганизаций.СпособОтраженияЗарплатыВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка)";
		
		УстановитьПривилегированныйРежим(Истина);
		Результат = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		Если Результат.Пустой() Тогда
			СпособОтражения = СоздатьСпособОтраженияПоНаименованию(НаименованиеСпособаОтражения);
		Иначе
			Выборка = Результат.Выбрать();
			СпособОтражения = Выборка.СпособОтраженияЗарплатыВБухучете;
		КонецЕсли;	
		
	КонецЕсли;
	
	Настройки.СпособОтраженияЗарплатыВБухучете = СпособОтражения;
	Настройки.Период = ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведенийСПериодомМесяц();
	
	Возврат Настройки;

КонецФункции


#КонецОбласти
